# BaseOrTop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment..::..BaseOrTop Property
ColumnAttachment Class See Also
---
Identifies if this ColumnAttachment is at the base or top of the column.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int BaseOrTop { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BaseOrTop As Integer
	Get
```

Visual C++
---
```text
public:
property int BaseOrTop {
	int get ();
}
```

# See Also
ColumnAttachment Class
Autodesk.Revit.DB Namespace